Repository: rtulke/mlocate-ng
Catalog: po/*.po
Languages: ro

source: warning: Line number overflow
ro: avertisment: depășirea numărului de linii

source: missing closing `"'
ro: lipsește `"' de închidere

source: can not open `%s'
ro: nu se poate deschide `%s'

source: unknown variable `%s'
ro: variabila `%s' este necunoscută

source: variable name expected
ro: se așteaptă un nume de variabilă

source: variable `%s' was already defined
ro: variabila `%s' era deja definită

source: `=' expected after variable name
ro: se așteaptă `=' după numele variabilei

source: value in quotes expected after `='
ro: se așteaptă o valoare între ghilimele după `='

source: invalid value `%s' of PRUNE_BIND_MOUNTS
ro: valoare nevalidă `%s' pentru PRUNE_BIND_MOUNTS

source: unexpected data after variable value
ro: date neașteptate după valoarea variabilei

source: I/O error reading `%s'
ro: eroare I/O la citirea `%s'

source: Usage: updatedb [OPTION]... Update a mlocate database. -f, --add-prunefs FS omit also FS -n, --add-prunenames NAMES omit also NAMES -e, --add-prunepaths PATHS omit also PATHS -U, --database-root PATH the subtree to store in database (default "/") -h, --help print this help -o, --output FILE database to update (default `%s') --prune-bind-mounts FLAG omit bind mounts (default "no") --prunefs FS filesystems to omit from database --prunenames NAMES directory names to omit from database --prunepaths PATHS paths to omit from database -l, --require-visibility FLAG check visibility before reporting files (default "yes") -v, --verbose print paths of files as they are found -V, --version print version information The configuration defaults to values read from `%s'.
ro: Folosire: updatedb [OPȚIUNE]... Actualizează o bază de date mlocate. -f, --add-prunefs FS omite și sistemele de fișiere FS -n, --add-prunenames NUME omite și numele NUME -e, --add-prunepaths CĂI omite și căile CĂI -U, --database-root CALE cale radăcină pentru a stoca baza de date (implicit "/") -h, --help afișează acest text de ajutor -o, --output FIȘIER bază de date de actualizat (implicit `%s') --prune-bind-mounts SETARE omite legăturile de montare (implicit "no") --prunefs FS sisteme de fișiere de omis din baza de date --prunenames NUME numele de omis din baza de date --prunepaths CĂI căile de omis din baza de date -l, --require-visibility SETARE verifică vizibilitatea înainte de a raporta fișiere (implicit "yes") -v, --verbose afișează căile fișierelor pe măsură ce acestea sunt găsite -V, --version afișează informații despre versiune Configurarea este creată în mod implicit cu valorile citite din `%s'.

source: Report bugs to %s.
ro: Raportați erorile la %s.

source: can not get current working directory
ro: nu se poate determina directorul de lucru curent

source: --%s would override earlier command-line argument
ro: --%s ar suprascrie argumentul anterior din linia de comandă

source: invalid value `%s' of --%s
ro: valoare nevalidă `%s' din --%s

source: --%s specified twice
ro: --%s specificat de două ori

source: Copyright (C) 2007 Red Hat, Inc. All rights reserved. This software is distributed under the GPL v.2. This program is provided with NO WARRANTY, to the extent permitted by law.
ro: Drepturi de autor (C) 2007 Red Hat, Inc. Toate drepturile rezervate. Acest software este distribuit sub licența GPL v.2. Acest program este oferit fără NICIO GARANȚIE, în măsura permisă de lege.

source: unexpected operand on command line
ro: operand neașteptat în linia de comandă

source: `%s' does not seem to be a mlocate database
ro: `%s' nu pare să fie o bază de date mlocate

source: `%s' has unknown version %u
ro: `%s' are versiunea necunoscută %u

source: `%s' has unknown visibility flag %u
ro: `%s' are marcaj de vizibilitate %u invalid

source: unexpected EOF reading `%s'
ro: EOF neașteptat la citirea `%s'

source: I/O error seeking in `%s'
ro: eroare de I/O la căutarea în `%s'

source: Database %s:
ro: Bază de date %s:

source: %'ju directory
ro: %'ju director

source: %'ju file
ro: %'ju fișier

source: %'ju byte in file names
ro: %'ju octet în numele fișierelor

source: %'ju byte used to store database
ro: %'ju octet folosit pentru a stoca baza de date

source: invalid empty directory name in `%s'
ro: nume gol invalid de director în `%s'

source: file name length %zu in `%s' is too large
ro: lungimea %zu a numelui de fișier este prea mare în `%s'

source: Usage: locate [OPTION]... [PATTERN]... Search for entries in a mlocate database. -A, --all only print entries that match all patterns -b, --basename match only the base name of path names -c, --count only print number of found entries -d, --database DBPATH use DBPATH instead of default database (which is %s) -e, --existing only print entries for currently existing files -L, --follow follow trailing symbolic links when checking file existence (default) -h, --help print this help -i, --ignore-case ignore case distinctions when matching patterns -l, --limit, -n LIMIT limit output (or counting) to LIMIT entries -m, --mmap ignored, for backward compatibility -P, --nofollow, -H don't follow trailing symbolic links when checking file existence -0, --null separate entries with NUL on output -S, --statistics don't search for entries, print statistics about each used database -q, --quiet report no error messages about reading databases -r, --regexp REGEXP search for basic regexp REGEXP instead of patterns --regex patterns are extended regexps -s, --stdio ignored, for backward compatibility -V, --version print version information -w, --wholename match whole path name (default)
ro: Folosire: locate [OPȚIUNE]... [ȘABLON]... Caută intrări într-o bază de date mlocate. -A, --all afișează doar intrările care se potrivesc cu toate șabloanele -b, --basename caută doar în baza numelui din numele căilor -c, --count afișează doar numărul intrărilor găsite -d, --database CALE_BD folosește CALE_BD în locul bazei de date implicite (aceasta este %s) -e, --existing afișează doar intrările pentru fișierele curente existente -L, --follow urmărește sfârșitul legăturilor simbolice la verificarea existenței fișierelor (implicit) -h, --help afișează acest text de ajutor -i, --ignore-case ignoră distincția majusculelor la căutarea șabloanelor -l, --limit, -n LIMITĂ limitează ieșirea (sau contorizarea) la un număr de LIMITĂ intrări -m, --mmap ignorată, pentru compatibilitate cu versiunile anterioare -P, --nofollow, -H nu urmărește sfârșitul legăturilor simbolice la verificarea existenței fișierelor (implicit) -0, --null separă intrările cu NUL la ieșire -S, --statistics nu caută intrări, afișează doar statistici despre fiecare bază de date folosită -q, --quiet nu raporta mesaje de eroare la citirea bazelor de date -r, --regexp REGEXP caută cu expresii regulate REGEXP în locul șabloanelor --regex șabloanele sunt expresii regulate extinse -s, --stdio ignorată, pentru compatibilitate cu versiunile anterioare -V, --version afișează informații despre versiune -w, --wholename caută în tot numele de cale (implicit)

source: non-option arguments are not allowed with --%s
ro: argumentele fără opțiune nu sunt permise cu --%s

source: no pattern to search for specified
ro: nu s-a specificat niciun șablon de căutare

source: invalid regexp `%s': %s
ro: expresie regulată `%s' invalidă: %s

source: can not drop privileges
ro: nu se pot abandona privilegile

source: can not read two databases from standard input
ro: nu se pot citi două baze de date de la intrarea standard

source: can not stat () `%s'
ro: nu se poate face stat () `%s'

source: I/O error while writing to standard output
ro: eroare de I/O în timpul scrierii la ieșirea standard

source: file name length %zu is too large
ro: lungimea numelui de fișier %zu este prea mare

source: file system error: zero-length file name in directory %s
ro: eroare de sistem de fișiere: lungime zero a numelui de fișier în directorul %s

source: can not open a temporary file for `%s'
ro: nu se poate deschide un fișier temporar pentru `%s'

source: configuration is too large
ro: configurarea este prea mare

source: can not find group `%s'
ro: nu se poate găsi grupul `%s'

source: can not change group of file `%s' to `%s'
ro: nu se poate schimba grupul fișierului `%s' în `%s'

source: can not change permissions of file `%s'
ro: nu se pot modifica permisiunile fișierului `%s'

source: `%s' is locked (probably by an earlier updatedb)
ro: `%s' este blocat (probabil o comandă updatedb anterioară)

source: can not lock `%s'
ro: nu se poate bloca `%s'

source: can not change directory to `%s'
ro: nu se poate schimba directorul în `%s'

source: I/O error while writing to `%s'
ro: eroare I/O în timpul scrierii în `%s'

source: error replacing `%s'
ro: eroare la înlocuirea `%s'
